# BasepointLatitudeParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BasepointLatitudeParam Property
ParameterTypeId Class See Also
---
"Lat"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BasepointLatitudeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BasepointLatitudeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BasepointLatitudeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace